Catalogs/бит_си_Статьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_си_Статьи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Comment>ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВСодержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МестаИспользования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМетки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопИнформация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_си_УстановленныеМеткиСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_си_УстановленныеМеткиСтатей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_си_Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_си_МеткиСтатей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_си_МеткиСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_си_МеткиСтатей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пиктограмма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВСодержании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВДопСсылках</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВЗаголовке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРезультатахПоиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_си_Статьи/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем РабочийТекстHTML Экспорт; // Хранит текущий редактируемый текст статьи справочной информации.

#КонецОбласти

#Область ПроцедурыИФункцииЗагрузкиСохранинияHTMLСТАТЬИСправки

// Выгружает сохраненные изображения во временный каталог, заменяет ссылки.
// В HTML-статье справки ссылками на выгруженные файлы, возвращает итоговый текст HTML-статьи.
// 
// Параметры: 
// Возвращаемое значение:
// 	Возврат ...        	 -	Строка                 	 Текст HTML-статьи после замены.                                   
//
Функция ЗагрузитьИзображенияИзБД(Каталог = "", СписокКартинок = Неопределено) Экспорт
	сзФайлы = Изображения.Получить(); // СписокЗначений: Значение - ДвоичныеДанные изображения,.
	//				 Представление - Ид изображения в тексте HTML.
	ВремТекстHTML = ТекстHTML;
	
	Если сзФайлы <> Неопределено Тогда
		Для Каждого ТекФайл Из сзФайлы Цикл
			ПолныйПутьКИзображению = ПолучитьИмяВременногоФайла("bit_h_img");

			ТекФайл.Значение.Записать(ПолныйПутьКИзображению);
			ВремТекстHTML = СтрЗаменить(ВремТекстHTML, ТекФайл.Представление, ПолныйПутьКИзображению);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ВремТекстHTML;
КонецФункции // ЗагрузитьИзображенияИзБД()

// Анализирует текст HTML-статьи справки и возвращает список ссылок на изображения.
// 
// Параметры: 
// 	пТекстHTML         	 -	                       	 Текст HTML-статьи справки.                                        
// Возвращаемое значение:
// 	Возврат ...        	 -	СписокЗначений         	 Список изображений: Значение - путь к файлу изображения;.          
// 	                   	  	                       	 Представление - Идентификатор изображения для сохранения в ИБ.    
//
Функция ПолучитьСсылкиНаИзображения(Знач пТекстHTML)
	сзСсылки = Новый СписокЗначений;
	Src_Открыт = Ложь;
	ВсегоСтрок = СтрЧислоСтрок(пТекстHTML);
	
	Для СчСтрок = 1 По ВсегоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(пТекстHTML, СчСтрок);
		ВсегоСимволов = СтрДлина(ТекСтрока);
		
		IMG_Начало = Найти(ВРег(ТекСтрока),"<IMG");
		
		Если IMG_Начало <> 0 Тогда
			IMG_Начало = IMG_Начало + 4;
			IMG_Путь = "";
			
			Для СчСимвол = IMG_Начало По ВсегоСимволов Цикл
				ТекСимвол = Сред(ТекСтрока,СчСимвол,1);
				
				Если ТекСимвол = Символ(34) И Src_Открыт Тогда
					ИмяДляЗамены = СокрЛП(Новый УникальныйИдентификатор);
					ИмяДляЗамены = "img_hlp1c_" + ИмяДляЗамены;
					
					СчСимвол = СчСимвол - (СтрДлина(IMG_Путь) - СтрДлина(ИмяДляЗамены));
					ТекСтрока = СтрЗаменить(ТекСтрока,IMG_Путь,ИмяДляЗамены);
					
					сзСсылки.Добавить(IMG_Путь,ИмяДляЗамены);
					
					IMG_Путь = "";
					Src_Открыт = Ложь;
				КонецЕсли;
				
				Если НРег(Сред(ТекСтрока,СчСимвол,5)) = ("src=" + Символ(34)) Тогда
					СчСимвол = СчСимвол + 5;
					Src_Открыт = Истина;
				КонецЕсли;
				
				Если Src_Открыт Тогда
					IMG_Путь = IMG_Путь + Сред(ТекСтрока,СчСимвол,1);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;	
	
	Возврат сзСсылки;
КонецФункции // ПолучитьСсылкиНаИзображения()

// На основе списка изображений создает список файлов изображений,.
// В виде двоичных данных, для сохранения в ИБ.
// 
// Параметры: 
// 	сзСсылки           	 -	СписокЗначений         	 Список файлов изображений: Значение - путь к файлу; Представление.
// 	                   	  	                       	 - Идентификатор изображения.                                      
// Возвращаемое значение:
// 	Возврат ...        	 -	СписокЗначений         	 Список изображений для сохранения в ИБ: Значение - ДвоичныеДанные.
// 	                   	  	                       	 - изображение; Представление - Идентификатор изображения.         
//
Функция ПолучитьФайлыПоСсылкам(сзСсылки,ТекКаталог="")
	сзФайлы = Новый СписокЗначений;
	
	Для Каждого ТекПутьКФайлу Из сзСсылки Цикл
		ПутьКФайлу = ТекПутьКФайлу.Значение;
		Если Найти(ПутьКФайлу,":") = 0 Тогда
			ПутьКФайлу = ТекКаталог + ?(Прав(ТекКаталог,1)="\","","\") + ПутьКФайлу;
		КонецЕсли;
		КаталогНаДиске = Новый Файл(ПутьКФайлу);
		Если КаталогНаДиске.Существует() Тогда
			сзФайлы.Добавить(Новый ДвоичныеДанные(ПутьКФайлу),ТекПутьКФайлу.Представление);
		Иначе
			#Если Клиент Тогда

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка сохранения файла! (" + ПутьКФайлу + ")");
				
			#КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
	Возврат сзФайлы;	
КонецФункции // ПолучитьФайлыПоСсылкам()

// Сохраняет изображения из временных файлов в текущий элемент справочника статьи, выполняет замену.
// Ссылок на изображения и записывает полученный текст также в текущий элемент.
// 
// Параметры 
// 	РабочийТекстHTML   	 -	Строка                 	 Текст HTML-статьи справки.                                        
// Возвращаемое значение:
// 	Возврат ...        	 -	Булево                 	 Истина - сохранение прошло успешно; Ложь в противном случае.      
//
Функция СохранитьИзображенияВБД(РабочийТекстHTML, ТекКаталог = "") Экспорт
	Если РабочийТекстHTML = Неопределено Тогда
		РабочийТекстHTML = ЭтотОбъект.ТекстHTML;
	КонецЕсли;
	
	Попытка
		сзСсылки	= ПолучитьСсылкиНаИзображения(РабочийТекстHTML);
		сзФайлы		= ПолучитьФайлыПоСсылкам(сзСсылки, ТекКаталог);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	// Изменение реквизитов.
	ЭтотОбъект.Изображения = Новый ХранилищеЗначения(сзФайлы,Новый СжатиеДанных);
	ВремТекстHTML = РабочийТекстHTML;
	Для Каждого ТекСсылка Из сзСсылки Цикл
		ВремТекстHTML = СтрЗаменить(ВремТекстHTML,ТекСсылка.Значение,ТекСсылка.Представление);
	КонецЦикла;
	ЭтотОбъект.ТекстHTML = ВремТекстHTML;
	
	Возврат Истина;
КонецФункции // СохранитьИзображенияВБД()

// Получает таблицу всех используемых меток статей.
// 
// Параметры: 
// 	ВыгрузитьКартинки  	 -	Булево                 	 Истина - картинки сохраняются в файлы; Ложь - в противном случае.
// 	Каталог			   	 -	Строка                 	 Каталог для сохранения картинок, если не указан,.
//													 То используется каталог временных файлов.
// Возвращаемое значение:
// 	Возврат ...        	 -	ТаблицаЗначений        	 Таблица используемых меток.
//
Функция ПолучитьМеткиСтатьи(ВыгрузитьКартинки = Ложь, Каталог = "") Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	УстановленныеМеткиСтатей.Метка КАК Ссылка,
	|	УстановленныеМеткиСтатей.Метка.Наименование КАК Наименование,
	|	УстановленныеМеткиСтатей.Метка.Описание КАК Описание
	|ИЗ
	|	РегистрСведений.бит_си_УстановленныеМеткиСтатей КАК УстановленныеМеткиСтатей
	|ГДЕ
	|	УстановленныеМеткиСтатей.Метка ССЫЛКА Справочник.бит_си_МеткиСтатей
	|	И УстановленныеМеткиСтатей.Статья = &Статья";
	Запрос.УстановитьПараметр("Статья", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	#Если Клиент Тогда
		Результат.Колонки.Добавить("Картинка", Новый ОписаниеТипов(?(ВыгрузитьКартинки, "Строка", "Картинка")));
		Если ВыгрузитьКартинки Тогда
			КартинкаПоУмолчанию = ПолучитьИмяВременногоФайла("bit_h_img");
			Если НЕ Каталог = "" Тогда
				СоздатьКаталог(Каталог);
				ВремКаталог = "";
				ВремФайл = "";
				бит_си_ИсточникСправочникСтатьи.бит_си_ПолучитьКаталогИИмяФайла(КартинкаПоУмолчанию, ВремКаталог, ВремФайл);
				КартинкаПоУмолчанию = бит_си_ИсточникСправочникСтатьи.бит_си_ПолучитьИмяФайла(Каталог, ВремФайл);
			КонецЕсли;
			БиблиотекаКартинок.бит_си_МеткаСтатьи.Записать(КартинкаПоУмолчанию);
		Иначе
			КартинкаПоУмолчанию = БиблиотекаКартинок.бит_си_МеткаСтатьи;
		КонецЕсли;
		Для Каждого ТекМетка Из Результат Цикл
			ВремКартинка = ТекМетка.Ссылка.Пиктограмма.Получить();
			Если НЕ ТипЗнч(ВремКартинка) = Тип("Картинка") ИЛИ ВремКартинка.Вид = ВидКартинки.Пустая Тогда
				ТекМетка.Картинка = КартинкаПоУмолчанию;
			ИначеЕсли ВыгрузитьКартинки Тогда
				ТекМетка.Картинка = ПолучитьИмяВременногоФайла("bit_h_img");
				Если НЕ Каталог = "" Тогда
					СоздатьКаталог(Каталог);
					ВремКаталог = "";
					ВремФайл = "";
					бит_си_ИсточникСправочникСтатьи.бит_си_ПолучитьКаталогИИмяФайла(ТекМетка.Картинка, ВремКаталог, ВремФайл);
					ТекМетка.Картинка = бит_си_ИсточникСправочникСтатьи.бит_си_ПолучитьИмяФайла(Каталог, ВремФайл);
				КонецЕсли;
				ВремКартинка.Записать(ТекМетка.Картинка);
			Иначе
				ТекМетка.Картинка = ВремКартинка;
			КонецЕсли;
		КонецЦикла;
	#КонецЕсли
	Возврат Результат;
КонецФункции // ПолучитьМеткиСтатьи()

#КонецОбласти

#Область ПроцедурыИФункцииВставкиСсылокВТекстСТАТЬИСправки

#Если Клиент Тогда
	
// Вставляет ссылку указанного вида в текущую позицию.
// Курсора в переданном поле текстового документа.
// 
// Параметры: 
// 	ВидСсылки          	 -	Строка                 	 
// Вид вставляемой ссылки: СтатьяСправки - ссылка на конкретную.
// Статью справки; ФормаСписка - Ссылка, открывающая форму списка. 
// Указанного объекта; Объект - ссылка.
//  Конкретный объект данных,отчет или обработку.                                              
// 	Владелец           	 -	Форма                  	 Форма владелец диалога выбора объекта.                            
// 	ПолеТекстовогоДокумента	 -	ПолеТекстовогоДокумента	 Поле.
// В котором в текущей позиции курсора будет размещена ссылка.  
// 	               	  	                       	                                                                  
//
Процедура ВставитьСсылкуВТекст(ВидСсылки, Владелец, ПолеТекстовогоДокумента) Экспорт
	Если ВидСсылки = "СтатьяСправки" Тогда
		ФормаСтатьи = Справочники.бит_си_Статьи.ПолучитьФормуВыбора(,Владелец);
		РезСтруктура = Неопределено;
		
		ФормаСтатьи.Показать(Новый ОписаниеОповещения("ВставитьСсылкуВТекстЗавершение1", ЭтотОбъект, Новый Структура("Владелец, ПолеТекстовогоДокумента", Владелец, ПолеТекстовогоДокумента)));
	ИначеЕсли ВидСсылки = "ФормаСписка" Тогда
		ИменаКоллекций = Новый Массив;
		ИменаКоллекций.Добавить("Справочники");
		ИменаКоллекций.Добавить("Документы");
		ИменаКоллекций.Добавить("РегистрыСведений");
		ФормаДерева = ЭтотОбъект.ПолучитьФорму("ДеревоМетаданныхУправляемая",Владелец);
		ФормаДерева.мИменаКоллекций = ИменаКоллекций;
		ФормаДерева.Показать(Новый ОписаниеОповещения("ВставитьСсылкуВТекстЗавершение", ЭтотОбъект, Новый Структура("Владелец, ПолеТекстовогоДокумента", Владелец, ПолеТекстовогоДокумента))); 
	ИначеЕсли ВидСсылки = "Объект" Тогда
		ИменаКоллекций = Новый Массив;
		ИменаКоллекций.Добавить("Справочники");
		ИменаКоллекций.Добавить("Документы");
		ИменаКоллекций.Добавить("Отчеты");
		ИменаКоллекций.Добавить("Обработки");
		ФормаДерева = ЭтотОбъект.ПолучитьФорму("ДеревоМетаданныхУправляемая",Владелец);
		ФормаДерева.мИменаКоллекций = ИменаКоллекций;
		РезСтруктура = ФормаДерева.ОткрытьМодально(30);
		Если НЕ РезСтруктура = Неопределено Тогда
			Если НЕ Найти("Справочники, Документы", РезСтруктура.ВидОбъекта) = 0 Тогда
				Менеджер = бит_си_ИсточникСправочникСтатьи.ПолучитьМенеджер(РезСтруктура.ВидОбъекта);
				ФормаВыбора = Менеджер[РезСтруктура.ИмяОбъекта].ПолучитьФормуВыбора(,Владелец);
				ЗначениеВыбора = ФормаВыбора.ОткрытьМодально(30);
				Если ЗначениеВыбора <> Неопределено Тогда
					ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
					РезСтруктура.ВидОбъекта +
					"@" + РезСтруктура.ИмяОбъекта +
					"@" + СокрЛП(ЗначениеВыбора.УникальныйИдентификатор()) +
					"""> " + ЗначениеВыбора + " </a>";
					бит_си_ИсточникСправочникСтатьи.ВставитьТекстПоКурсору(ПолеТекстовогоДокумента,ТекстДляВставки);
					Владелец.Модифицированность = Истина;
				КонецЕсли; 
			Иначе	
				ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
				РезСтруктура.ВидОбъекта +
				"@" + РезСтруктура.ИмяОбъекта +
				"@Форма" + """> " +
				РезСтруктура.Синоним + " </a>";
				бит_си_ИсточникСправочникСтатьи.ВставитьТекстПоКурсору(ПолеТекстовогоДокумента,ТекстДляВставки);
				Владелец.Модифицированность = Истина;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ВставитьСсылкуВТекстЗавершение1(Результат, ДополнительныеПараметры) Экспорт
	
	Владелец = ДополнительныеПараметры.Владелец;
	ПолеТекстовогоДокумента = ДополнительныеПараметры.ПолеТекстовогоДокумента;
	
	
	РезСтруктура = Результат;
	Если НЕ РезСтруктура = Неопределено Тогда
		ТекстДляВставки = "<a href=""ВнСсылка=" +
		СокрЛП(РезСтруктура.УникальныйИдентификатор()) +
		"""> " +
		РезСтруктура.НазваниеСтатьи +
		" </a>";
		бит_си_ИсточникСправочникСтатьи.ВставитьТекстПоКурсору(ПолеТекстовогоДокумента,ТекстДляВставки);
		Владелец.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ВставитьСсылкуВТекстЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Владелец = ДополнительныеПараметры.Владелец;
	ПолеТекстовогоДокумента = ДополнительныеПараметры.ПолеТекстовогоДокумента;
	
	
	РезСтруктура = Результат;
	Если РезСтруктура <> Неопределено Тогда
		ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
		РезСтруктура.ВидОбъекта +
		"@" + РезСтруктура.ИмяОбъекта +
		"@ФормаСписка" + """> " +
		РезСтруктура.Синоним + " </a>";
		бит_си_ИсточникСправочникСтатьи.ВставитьТекстПоКурсору(ПолеТекстовогоДокумента,ТекстДляВставки);
		Владелец.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ВставитьСсылкуВТекст()
	
#КонецЕсли

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура обработчик - события "ПередЗаписью" объекта.
// 
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И НЕ РабочийТекстHTML = Неопределено Тогда
		Отказ = НЕ СохранитьИзображенияВБД(РабочийТекстHTML);
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#КонецЕсли
